# TreadDepthTooBigFailure Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..TreadDepthTooBigFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
The tread depth is too large for the spiral run.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TreadDepthTooBigFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TreadDepthTooBigFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TreadDepthTooBigFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace